Управление_торговлей.ПБТ/src/DataProcessors/РабочееМестоКредитногоКонтролера/РабочееМестоКредитногоКонтролера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКредитногоКонтролера</name>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1c557a08-a198-42cc-b04b-1e4babf5ae8f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efe047-c6c6-4ed5-8e67-1aaac72c2f18">
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="441849e1-2a80-4d78-b953-7de4fe6a6810">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2ac11719-c923-4a29-ab63-a3f0bf59916c">
      <name>Сдвиг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b841ab09-8b12-49d7-affb-964712f5bbd2">
    <name>ДопустимаяСуммаЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a341cde0-c6be-4cb2-93c7-743bc8cbf219">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/DataProcessors/РабочееМестоКредитногоКонтролера/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()

    ОбСписок = РеквизитФормыВЗначение("Список");
    ОбСписок.Строки.Очистить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(СоглашенияСКлиентамиЭтапыГрафикаОплаты.Сдвиг) КАК Сдвиг,
	               |	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка КАК Соглашение
	               |ПОМЕСТИТЬ ВТ_Сдвиги
	               |ИЗ
	               |	Справочник.СоглашенияСКлиентами.ЭтапыГрафикаОплаты КАК СоглашенияСКлиентамиЭтапыГрафикаОплаты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	СоглашенияСКлиентами.Ссылка КАК Соглашение,
	               |	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
	               |	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	               |	СоглашенияСКлиентами.Календарь КАК Календарь,
	               |	ВТ_Сдвиги.Сдвиг КАК Отсрочка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО Контрагенты.Ссылка = ДоговорыКонтрагентов.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	               |		ПО Контрагенты.Ссылка = СоглашенияСКлиентами.Контрагент
	               |			И (ДоговорыКонтрагентов.Наименование = СоглашенияСКлиентами.Наименование)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сдвиги КАК ВТ_Сдвиги
	               |		ПО (СоглашенияСКлиентами.Ссылка = ВТ_Сдвиги.Соглашение)
	               |ИТОГИ ПО
	               |	Контрагент";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ОбСписок = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	
		НовСтр = ОбСписок.Строки.Добавить();
	    ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
		ВыборкаДог = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДог.Следующий() Цикл
			СтрДог = НовСтр.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДог, ВыборкаДог);
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбСписок, "Список");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокДопустимаяСуммаЗадолженностиПриИзмененииНаСервере(ТекДоговор, Сумма)
	
	ДогОб = ТекДоговор.ПолучитьОбъект();
	ДогОб.ДопустимаяСуммаЗадолженности = Сумма;
	ДогОб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДопустимаяСуммаЗадолженностиПриИзменении(Элемент)
	
	Сумма = Элементы.Список.ТекущиеДанные.ДопустимаяСуммаЗадолженности;
	ТекДоговор = Элементы.Список.ТекущиеДанные.Договор;
	СписокДопустимаяСуммаЗадолженностиПриИзмененииНаСервере(ТекДоговор, Сумма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокОтсрочкаПриИзмененииНаСервере(Соглашение, Отсрочка)
	
	CогОб = Соглашение.ПолучитьОбъект();
	Если CогОб.ЭтапыГрафикаОплаты.Количество()>0 Тогда
		ПерваяСтрока = CогОб.ЭтапыГрафикаОплаты[0];
	    ПерваяСтрока.Сдвиг = Отсрочка;
	КонецЕсли; 
	
	CогОб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтсрочкаПриИзменении(Элемент)
	
	Отсрочка = Элементы.Список.ТекущиеДанные.Отсрочка;
	Соглашение = Элементы.Список.ТекущиеДанные.Соглашение;
	
	СписокОтсрочкаПриИзмененииНаСервере(Соглашение, Отсрочка);
	
КонецПроцедуры
